ARMmbed/mbed-os/features/FEATURE_BLE/targets/TARGET_NORDIC/TARGET_NRF5/source/nRF5XPalGattClient.cpp
/* mbed Microcontroller Library
 * Copyright (c) 2017-2017 ARM Limited
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include <memory>

#include "nRF5XPalGattClient.h"

#include "ble/pal/PalGattClient.h"
#include "ble/pal/SimpleAttServerMessage.h"

#include "nrf_ble_gatt.h"
#include "nrf_ble.h"
#include "nrf_ble_types.h"
#include "nrf_ble_err.h"

namespace ble {
namespace pal {
namespace vendor {
namespace nordic {

namespace {

/**
 * Extract an uint16_t value from a memory location.
 */
static uint16_t bytes_to_u16(const void *b)
{
    uint16_t res;
    memcpy(&res, b, sizeof(uint16_t));
    return res;
}

/**
 * Push an uint16_t value into a byte stream.
 *
 * @note it is incremented.
 */
static void u16_to_stream(uint8_t *&it, uint16_t v)
{
    memcpy(it, &v, sizeof(uint16_t));
    it += 2;
}

/**
 * Convert a pal::attribute_handle_range_t into a ble_gattc_handle_range_t.
 */
static ble_gattc_handle_range_t to_nordic_handle_range(const attribute_handle_range_t &range)
{
    ble_gattc_handle_range_t result = {
        range.begin,
        range.end
    };
    return result;
}

/**
 * Convert a ble_gattc_handle_range_t into a pal::attribute_handle_range_t.
 */
static attribute_handle_range_t to_ble_handle_range(const ble_gattc_handle_range_t &range)
{
    attribute_handle_range_t result = {
        range.start_handle,
        range.end_handle
    };
    return result;
}

/**
 * Convert an error from the softdevice into a ble_error_t
 */
static ble_error_t convert_sd_error(uint32_t err)
{
    switch (err) {
        case NRF_SUCCESS:
            return BLE_ERROR_NONE;
        case NRF_ERROR_INVALID_PARAM:
        case BLE_ERROR_INVALID_CONN_HANDLE:
        case NRF_ERROR_INVALID_ADDR:
            return BLE_ERROR_INVALID_PARAM;
        case NRF_ERROR_INVALID_STATE:
            return BLE_ERROR_INVALID_STATE;
        case NRF_ERROR_DATA_SIZE:
            return BLE_ERROR_PARAM_OUT_OF_RANGE;
        case BLE_ERROR_NO_TX_PACKETS:
            return BLE_ERROR_NO_MEM;
        case NRF_ERROR_BUSY:
            return BLE_STACK_BUSY;
        case NRF_ERROR_NO_MEM:
            return BLE_ERROR_NO_MEM;
        default:
            return BLE_ERROR_UNSPECIFIED;
    }
}

/**
 * Convert a UUID into a ble_uuid_t .
 * If the UUID is a 128 bit one then it is registered into the softdevice.
 */
static ble_error_t to_nordic_uuid(const UUID &uuid, ble_uuid_t &nordic_uuid)
{
    if (uuid.getLen() == UUID::LENGTH_OF_LONG_UUID) {
        // first try to get the long UUID in the table of UUIDs
        uint32_t err = sd_ble_uuid_decode(
                           uuid.getLen(),
                           uuid.getBaseUUID(),
                           &nordic_uuid
                       );

        // UUID found and filed, return.
        if (err == NRF_SUCCESS) {
            return BLE_ERROR_NONE;
        }

        ble_uuid128_t uuid128;
        memcpy(uuid128.uuid128, uuid.getBaseUUID(), sizeof(uuid128.uuid128));

        // UUID not found, try to register it
        err = sd_ble_uuid_vs_add(&uuid128, &nordic_uuid.type);
        if (err == NRF_SUCCESS) {
            nordic_uuid.uuid = bytes_to_u16(uuid.getBaseUUID() + 12);
        }

        return convert_sd_error(err);
    } else {
        nordic_uuid.type = BLE_UUID_TYPE_BLE;
        nordic_uuid.uuid = uuid.getShortUUID();
        return BLE_ERROR_NONE;
    }
}

/**
 * Convert an attribute error code from the softdevice into a valid ATT error.
 */
static uint8_t convert_sd_att_error_code(uint16_t err)
{
    if (err < 0x101 || err > 0x1FF) {
        return AttErrorResponse::UNLIKELY_ERROR;
    } else {
        return err & 0xFF;
    }
}

static const size_t long_uuid_length = 16;
static const size_t read_by_group_type_long_uuid_index = 4;
static const size_t characteristic_declaration_length = 1 + 2 + 16;

} // end of anonymous namespace

nRF5XGattClient::nRF5XGattClient() :
    ble::pal::GattClient(),
    _procedures()
{
}

nRF5XGattClient::~nRF5XGattClient()
{
    terminate();
}

ble_error_t nRF5XGattClient::initialize()
{
    return BLE_ERROR_NONE;
}

ble_error_t nRF5XGattClient::exchange_mtu(connection_handle_t connection)
{
    // FIXME: implement when SD 140 5.x.x is present
    // (see sd_ble_gatts_exchange_mtu_reply)
    return BLE_ERROR_NOT_IMPLEMENTED;
}

ble_error_t nRF5XGattClient::get_mtu_size(
    connection_handle_t connection_handle, uint16_t &mtu_size
)
{
#if (NRF_SD_BLE_API_VERSION >= 3)
    // FIXME: implement when MTU size can be configured; the mtu size must be
    // stored locally when BLE_GATTC_EVT_EXCHANGE_MTU_RSP has been received
    mtu_size = BLE_GATT_MTU_SIZE_DEFAULT;
#else
    mtu_size = GATT_RX_MTU;
#endif
    return BLE_ERROR_NONE;
}

ble_error_t nRF5XGattClient::discover_primary_service(
    connection_handle_t connection,
    attribute_handle_t discovery_range_begining
)
{
    return launch_procedure<DiscoverPrimaryServiceProcedure>(
               connection, discovery_range_begining
           );
}

ble_error_t nRF5XGattClient::discover_primary_service_by_service_uuid(
    connection_handle_t connection_handle,
    attribute_handle_t discovery_range_beginning,
    const UUID &uuid
)
{
    return launch_procedure<DiscoverPrimaryServiceByUUIDProcedure>(
               connection_handle, discovery_range_beginning, uuid
           );
}

ble_error_t nRF5XGattClient::find_included_service(
    connection_handle_t connection_handle,
    attribute_handle_range_t service_range
)
{
    return launch_procedure<FindIncludedServicesProcedure>(
               connection_handle, service_range
           );
}

ble_error_t nRF5XGattClient::discover_characteristics_of_a_service(
    connection_handle_t connection_handle,
    attribute_handle_range_t discovery_range
)
{
    return launch_procedure<DiscoverCharacteristicsProcedure>(
               connection_handle, discovery_range
           );
}

