ARMmbed/mbed-os/features/FEATURE_BLE/targets/TARGET_NORDIC/TARGET_NRF5/source/nRF5XPalGattClient.cpp
ble_error_t nRF5XGattClient::discover_characteristics_descriptors(
    connection_handle_t connection_handle,
    attribute_handle_range_t descriptors_discovery_range
)
{
    return launch_procedure<DiscoverDescriptorsProcedure>(
               connection_handle, descriptors_discovery_range
           );
}

ble_error_t nRF5XGattClient::read_attribute_value(
    connection_handle_t connection_handle,
    attribute_handle_t attribute_handle
)
{
    return launch_procedure<ReadAttributeProcedure>(
               connection_handle, attribute_handle
           );
}

ble_error_t nRF5XGattClient::read_using_characteristic_uuid(
    connection_handle_t connection_handle,
    attribute_handle_range_t read_range,
    const UUID &uuid
)
{
    return launch_procedure<ReadUsingCharacteristicUUIDProcedure>(
               connection_handle, read_range, uuid
           );
}

ble_error_t nRF5XGattClient::read_attribute_blob(
    connection_handle_t connection,
    attribute_handle_t attribute_handle,
    uint16_t offset
)
{
    return launch_procedure<ReadAttributeBlobProcedure>(
               connection, attribute_handle, offset
           );
}

ble_error_t nRF5XGattClient::read_multiple_characteristic_values(
    connection_handle_t connection,
    const ArrayView<const attribute_handle_t> &characteristic_handles
)
{
    return launch_procedure<ReadMultipleCharacteristicsProcedure>(
               connection, characteristic_handles
           );
}

ble_error_t nRF5XGattClient::write_without_response(
    connection_handle_t connection_handle,
    attribute_handle_t characteristic_value_handle,
    const ArrayView<const uint8_t> &value
)
{
    ble_gattc_write_params_t write_params = {
        BLE_GATT_OP_WRITE_CMD,
        /* exec flags */ 0,
        characteristic_value_handle,
        /* offset */ 0,
        static_cast<uint16_t>(value.size()),
        const_cast<uint8_t *>(value.data())
    };

    uint32_t err = sd_ble_gattc_write(connection_handle, &write_params);
    return convert_sd_error(err);
}

ble_error_t nRF5XGattClient::signed_write_without_response(
    connection_handle_t connection_handle,
    attribute_handle_t characteristic_value_handle,
    const ArrayView<const uint8_t> &value
)
{
    ble_gattc_write_params_t write_params = {
        BLE_GATT_OP_SIGN_WRITE_CMD,
        /* exec flags */ 0,
        characteristic_value_handle,
        /* offset */ 0,
        static_cast<uint16_t>(value.size()),
        const_cast<uint8_t *>(value.data())
    };

    uint32_t err = sd_ble_gattc_write(connection_handle, &write_params);
    return convert_sd_error(err);
}

ble_error_t nRF5XGattClient::write_attribute(
    connection_handle_t connection_handle,
    attribute_handle_t attribute_handle,
    const ArrayView<const uint8_t> &value
)
{
    return launch_procedure<WriteAttributeProcedure>(
               connection_handle, attribute_handle, value
           );
}

ble_error_t nRF5XGattClient::queue_prepare_write(
    connection_handle_t connection_handle,
    attribute_handle_t characteristic_value_handle,
    const ArrayView<const uint8_t> &value,
    uint16_t offset
)
{
    return launch_procedure<QueuePrepareWriteProcedure>(
               connection_handle, characteristic_value_handle, value, offset
           );
}

ble_error_t nRF5XGattClient::execute_write_queue(
    connection_handle_t connection_handle,
    bool execute
)
{
    return launch_procedure<ExecuteWriteQueueProcedure>(
               connection_handle, execute
           );
}


/**
 * Base definition of a GATT procedure.
 *
 * Nordic implementation of discovery procedures requires more than a single
 * request to the BLE peer when it involves 128bit UUID. As a consequence it is
 * necessary to reserve the connection slot, maintain state between requests and
 * interpret responses depending on the context.
 *
 * The concept of procedures for Gatt operations formalize the process. A
 * procedure lifecycle is defined by three function:
 *   - start: Launch of the procedure. It initiate the first request to send to
 *     the peer. It must be implemented by Procedure derived classes.
 *   - handle: Event handler that process ble events comming from the softdevice.
 *     This function drive the procedure flow and must be implemented by
 *     Procedure derived classes.
 *   - terminate: end the procedure and forward the result to the GattClient
 *     event handle.
 *
 * @note Commands such as write without response or signed write without response
 * are not procedures.
 */
struct nRF5XGattClient::GattProcedure {
    /**
     * Initialize the procedure.
     *
     * @param connection Handle representing the connection used by the procedure.
     * @param op Opcode of the procedure.
     */
    GattProcedure(connection_handle_t connection, AttributeOpcode op) :
        connection_handle(connection), procedure_opcode(op) { }

    /**
     * To overide in child if necessary.
     */
    virtual ~GattProcedure() { }

    /**
     * Handle events targeting the connection.
     */
    virtual void handle(const ble_evt_t &evt) = 0;

    /**
     * Terminate the execution of the procedure and forward msg to the handler
     * registered in the client.
     *
     * @note delete this.
     */
    void terminate(const AttServerMessage &msg)
    {
        get_client().remove_procedure(this);
        get_client().on_server_event(connection_handle, msg);
        delete this;
    }

    /**
     * Terminate the procedure with an unlikely error.
     */
    void abort()
    {
        terminate(AttErrorResponse(
                      procedure_opcode, AttErrorResponse::UNLIKELY_ERROR
                  ));
    }

    const connection_handle_t connection_handle;
    const AttributeOpcode procedure_opcode;
};


/**
 * A regular procedure is a procedure that follows Gatt specification.
 *
 * It initiate a single request to the peer and excepts a single response. This
 * kind of procedure doesn't requires extra processing step.
 *
 * Given that such procedure expects a single event type from the soft device,
 * error handling can be generalized.
 */
struct nRF5XGattClient::RegularGattProcedure : GattProcedure {

    /**
     * Construct a RegularGattProcedure.
     *
     * @param connection Handle of the connection used by the procedure.
     * @param op Attribute operation code
     * @param event_type Type of event expected by the stack.
     */
    RegularGattProcedure(
        connection_handle_t connection, AttributeOpcode op, BLE_GATTC_EVTS event_type
    ) : GattProcedure(connection, op), _event_type(event_type) { }

    /**
     * Handle events from the BLE stack; do not overide in child.
     *
     * @note This function offload error handling from user error handler. If
     * the event in input match the expected event type and does not carry error
     * then it is forwarded to the do_handle function. Otherwise the procedure
     * is terminated and an error is forwarded to the client event handler.
     */
    virtual void handle(const ble_evt_t &evt)
    {
        if (evt.header.evt_id == _event_type) {
            const ble_gattc_evt_t &gattc_evt = evt.evt.gattc_evt;
            if (gattc_evt.gatt_status != BLE_GATT_STATUS_SUCCESS) {
                terminate(AttErrorResponse(
                              procedure_opcode,
                              gattc_evt.error_handle,
                              convert_sd_att_error_code(gattc_evt.gatt_status)
                          ));
                return;
            } else {
                do_handle(gattc_evt);
            }
        } else {
            abort();
        }
    }

    /**
     * Handle gatt event received from the stack.
     *
     * @note The event passed in parameter is valid.
     */
    virtual void do_handle(const ble_gattc_evt_t &evt) = 0;

protected:
    BLE_GATTC_EVTS _event_type;
};


/**
 * Procedure that handle discovery of primary services.
 *
 * The softdevice doesn't forward to user UUID of services that are 128 bit long.
 * In such case a read request is issued for each service attribute handle
 * to extract that information.
 */
struct nRF5XGattClient::DiscoverPrimaryServiceProcedure : GattProcedure {

