ARMmbed/mbed-os/features/FEATURE_BLE/targets/TARGET_NORDIC/TARGET_NRF5/source/nRF5XPalGattClient.cpp
    typedef ArrayView<const ble_gattc_service_t> services_array_t;

    DiscoverPrimaryServiceProcedure(connection_handle_t connection) :
        GattProcedure(connection, AttributeOpcode::READ_BY_GROUP_TYPE_REQUEST),
        response(NULL), count(0), idx(0) { }

    virtual ~DiscoverPrimaryServiceProcedure()
    {
        if (response) {
            delete[] response;
        }
    }

    ble_error_t start(attribute_handle_t begining)
    {
        uint32_t err = sd_ble_gattc_primary_services_discover(
                           connection_handle, begining, /* p_srvc_uuid */ NULL
                       );
        return convert_sd_error(err);
    }

    /**
     * Dispatch responses either to service discovery handler or attribute read
     * handler.
     */
    virtual void handle(const ble_evt_t &evt)
    {
        switch (evt.header.evt_id) {
            case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP:
                handle_service_discovered(evt.evt.gattc_evt);
                return;
            case BLE_GATTC_EVT_READ_RSP:
                handle_uuid_read(evt.evt.gattc_evt);
                return;
            default:
                abort();
                return;
        }
    }

    /**
     * Dispatch service discovery response either to the short UUID handler or
     * the long UUID handler.
     */
    void handle_service_discovered(const ble_gattc_evt_t &evt)
    {
        if (evt.gatt_status != BLE_GATT_STATUS_SUCCESS) {
            terminate(AttErrorResponse(
                          AttributeOpcode::READ_BY_GROUP_TYPE_REQUEST,
                          convert_sd_att_error_code(evt.gatt_status)
                      ));
            return;
        }

        services_array_t services(
            evt.params.prim_srvc_disc_rsp.services,
            evt.params.prim_srvc_disc_rsp.count
        );

        // note 128 bit and 16 bits UUID cannot be mixed up
        if (services[0].uuid.type == BLE_UUID_TYPE_BLE) {
            handle_16bit_services_discovered(services);
        } else {
            handle_128bit_services_discovered(services);
        }
    }

    /**
     * Handle discovery of services with a 16 bit UUID.
     *
     * The procedure ends here.
     */
    void handle_16bit_services_discovered(const services_array_t &services)
    {
        /**
         * Custom implementation of AttReadByGroupTypeResponse that can be used
         * with data returned by the nordic stack.
         */
        struct CustomAttReadByGroupTypeResponse : AttReadByGroupTypeResponse {
            CustomAttReadByGroupTypeResponse(const services_array_t &s) :
                AttReadByGroupTypeResponse(), services(s)
            {
            }

            virtual size_t size() const
            {
                return services.size();
            }

            virtual attribute_data_t operator[](size_t i) const
            {
                attribute_data_t result = {
                    to_ble_handle_range(services[i].handle_range),
                    make_const_ArrayView(
                        reinterpret_cast<const uint8_t *>(&services[i].uuid.uuid),
                        sizeof(uint16_t)
                    )
                };
                return result;
            }

            const services_array_t &services;
        };

        terminate(CustomAttReadByGroupTypeResponse(services));
    }

    /**
     * Handle discovery of services with a 128 UUID.
     *
     * Handle of the services discovered will be stored locally then the
     * procedure sequentially initiate a read request of each of these attribute
     * handle to acquire the value of the UUID of the service.
     *
     * The procedure ends once all the informations initially sent by the peer
     * has been reconstructed and forwarded to the registered client handler.
     */
    void handle_128bit_services_discovered(const services_array_t &services)
    {
        response = new (std::nothrow) packed_discovery_response_t[services.size()];
        if (!response) {
            abort();
            return;
        }

        count = services.size();
        idx = 0;
        for (size_t i = 0; i < count; ++i) {
            uint8_t *it = &response[i][0];
            u16_to_stream(it, services[i].handle_range.start_handle);
            u16_to_stream(it, services[i].handle_range.end_handle);
        }

        read_service_uuid();
    }

    /**
     * Initiate the read request of the next service attribute handle.
     */
    void read_service_uuid(void)
    {
        // note: use read multiple once different mtu size are supported ?
        uint16_t attribute_handle = bytes_to_u16(&response[idx][0]);

        uint32_t err = sd_ble_gattc_read(connection_handle, attribute_handle, 0);
        if (err) {
            abort();
        }
    }

    /**
     * Handle reception of a service (long) UUID.
     */
    void handle_uuid_read(const ble_gattc_evt_t &evt)
    {
        if (evt.gatt_status != BLE_GATT_STATUS_SUCCESS) {
            terminate(AttErrorResponse(
                          AttributeOpcode::READ_REQUEST,
                          convert_sd_att_error_code(evt.gatt_status)
                      ));
            return;
        }

        const ble_gattc_evt_read_rsp_t &rsp = evt.params.read_rsp;

        uint16_t expected_handle = bytes_to_u16(&response[idx][0]);

        if (rsp.handle != expected_handle || rsp.offset != 0 ||
                rsp.len != long_uuid_length) {
            abort();
            return;
        }

        memcpy(&response[idx][read_by_group_type_long_uuid_index], rsp.data, rsp.len);

        ++idx;

        if (idx == count) {
            terminate(SimpleAttReadByGroupTypeResponse(
                          sizeof(packed_discovery_response_t),
                          make_const_ArrayView(
                              reinterpret_cast<const uint8_t *>(response),
                              count * sizeof(packed_discovery_response_t)
                          ))
                     );
        } else {
            read_service_uuid();
        }
    }

