ARMmbed/mbed-os/features/FEATURE_BLE/targets/TARGET_NORDIC/TARGET_NRF5/source/nRF5XPalGattClient.cpp
    // Hold read by group type response of services with 128 bit UUID.
    // The response is composed of the service attribute handle (2 bytes), the
    // end group handle (2 bytes) and the service UUID (16 bytes).
    typedef uint8_t packed_discovery_response_t[20];

    packed_discovery_response_t *response;
    uint16_t count;
    uint16_t idx;
};


/**
 * Procedure that manage Discover Primary Service by Service UUID transactions.
 *
 * @note Even if the softdevice doesn't forward the complete content of the peer
 * response it is possible to reconstruct it by keeping a copy of the UUID to
 * find.
 */
struct nRF5XGattClient::DiscoverPrimaryServiceByUUIDProcedure : RegularGattProcedure {

    typedef ArrayView<const ble_gattc_service_t> services_array_t;

    DiscoverPrimaryServiceByUUIDProcedure(connection_handle_t connection) :
        RegularGattProcedure(
            connection,
            AttributeOpcode::FIND_BY_TYPE_VALUE_REQUEST,
            BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP
        ),
        _service_uuid() { }

    ble_error_t start(attribute_handle_t begining, const UUID &uuid)
    {
        ble_uuid_t nordic_uuid;
        ble_error_t ble_err = to_nordic_uuid(uuid, nordic_uuid);
        if (ble_err) {
            return ble_err;
        }

        uint32_t err = sd_ble_gattc_primary_services_discover(
                           connection_handle, begining, &nordic_uuid
                       );
        if (!err) {
            _service_uuid = uuid;
        }

        return convert_sd_error(err);
    }

    virtual void do_handle(const ble_gattc_evt_t &evt)
    {
        services_array_t services(
            evt.params.prim_srvc_disc_rsp.services,
            evt.params.prim_srvc_disc_rsp.count
        );

        /**
         * Implementation of AttReadByGroupTypeResponse that addapt Nordic data
         * structure.
         */
        struct CustomAttReadByGroupTypeResponse : AttReadByGroupTypeResponse {
            CustomAttReadByGroupTypeResponse(const services_array_t &s, const UUID &u) :
                AttReadByGroupTypeResponse(), services(s), uuid(u)
            {
            }

            virtual size_t size() const
            {
                return services.size();
            }

            virtual attribute_data_t operator[](size_t i) const
            {
                attribute_data_t result = {
                    to_ble_handle_range(services[i].handle_range),
                    make_ArrayView(uuid.getBaseUUID(), uuid.getLen())
                };
                return result;
            }

            const services_array_t &services;
            const UUID &uuid;
        };

        terminate(CustomAttReadByGroupTypeResponse(services, _service_uuid));
    }

    UUID _service_uuid;
};


/**
 * Procedure that manage Find Included Services transactions.
 */
struct nRF5XGattClient::FindIncludedServicesProcedure : RegularGattProcedure {

    typedef ArrayView<const ble_gattc_service_t> services_array_t;

    FindIncludedServicesProcedure(connection_handle_t connection) :
        RegularGattProcedure(
            connection,
            AttributeOpcode::READ_BY_TYPE_REQUEST,
            BLE_GATTC_EVT_REL_DISC_RSP
        ) { }

    ble_error_t start(attribute_handle_range_t service_range)
    {
        ble_gattc_handle_range_t range = to_nordic_handle_range(service_range);
        uint32_t err = sd_ble_gattc_relationships_discover(
                           connection_handle, &range
                       );

        return convert_sd_error(err);
    }

    virtual void do_handle(const ble_gattc_evt_t &evt)
    {
        // recompose the message into a raw att read by type response.
        const ble_gattc_evt_rel_disc_rsp_t &resp = evt.params.rel_disc_rsp;

        bool contain_short_uuid =
            (resp.includes[0].included_srvc.uuid.type == BLE_UUID_TYPE_BLE);

        uint8_t element_size = 6;
        if (contain_short_uuid) {
            element_size += 2;
        }

        // It would be more efficient to use an API like alloca but it is
        // unavailable and unsafe. Another alternative would be to have a fixed
        // size stack buffer since the size of the MTU is fixed however once new
        // softdevices lands could would have to be rewritten because they support
        // variable MTU size.
        size_t buffer_size = element_size * resp.count;
        uint8_t *buffer = new (std::nothrow) uint8_t[buffer_size];
        if (!buffer) {
            abort();
            return;
        }

        uint8_t *it = buffer;
        for (size_t i = 0; i < resp.count; ++i) {
            u16_to_stream(it, resp.includes[i].handle);
            u16_to_stream(it, resp.includes[i].included_srvc.handle_range.start_handle);
            u16_to_stream(it, resp.includes[i].included_srvc.handle_range.end_handle);
            if (contain_short_uuid) {
                u16_to_stream(it, resp.includes[i].included_srvc.uuid.uuid);
            }
        }

        terminate(SimpleAttReadByTypeResponse(
                      element_size,
                      make_const_ArrayView(buffer, buffer_size)
                  ));

        delete[] buffer;
    }

    UUID _service_uuid;
};


/**
 * Procedure that handle Discover All Characteristics of a Service transactions.
 *
 * The softdevice doesn't forward to user UUID of services that are 128 bit long.
 * In such case a read request is issued for each attribute handle of
 * characteristics that exposes a long UUID.
 */
struct nRF5XGattClient::DiscoverCharacteristicsProcedure : GattProcedure {
    /**
     * Data structure returned by the function flatten_response.
     */
    struct read_by_type_response_t {
        uint16_t count;
        uint16_t element_size;
        uint8_t *buffer;
    };

    DiscoverCharacteristicsProcedure(connection_handle_t connection) :
        GattProcedure(connection, AttributeOpcode::READ_BY_TYPE_REQUEST),
        _response(), _idx(0) { }

    virtual ~DiscoverCharacteristicsProcedure()
    {
        if (_response.buffer) {
            delete[] _response.buffer;
        }
    }

    ble_error_t start(attribute_handle_range_t discovery_range)
    {
        ble_gattc_handle_range_t range = to_nordic_handle_range(discovery_range);
        uint32_t err = sd_ble_gattc_characteristics_discover(
                           connection_handle,
                           &range
                       );

        return convert_sd_error(err);
    }

    /**
     * Dispatch ble events to the appropriate handler:
     *   - handle_characteristic_discovered: For a discovery response.
     *   - handle_uuid_read: For a read response.
     */
    virtual void handle(const ble_evt_t &evt)
    {
        switch (evt.header.evt_id) {
            case BLE_GATTC_EVT_CHAR_DISC_RSP:
                handle_characteristic_discovered(evt.evt.gattc_evt);
                return;
            case BLE_GATTC_EVT_READ_RSP:
                handle_uuid_read(evt.evt.gattc_evt);
                return;
            default:
                abort();
                return;
        }
    }

