ARMmbed/mbed-os/features/FEATURE_BLE/targets/TARGET_NORDIC/TARGET_NRF5/source/nRF5XPalGattClient.cpp
    void handle_characteristic_discovered(const ble_gattc_evt_t &evt)
    {
        if (evt.gatt_status != BLE_GATT_STATUS_SUCCESS) {
            terminate(AttErrorResponse(
                          AttributeOpcode::READ_BY_TYPE_REQUEST,
                          convert_sd_att_error_code(evt.gatt_status)
                      ));
            return;
        }

        // layout the data structure into a flat byte array.
        _response = flatten_response(evt.params.char_disc_rsp);
        if (!_response.buffer) {
            abort();
            return;
        }

        // If element size is equal to 7 then the characteristic discovered
        // have 16 bit UUID. It is not necessary to read their characteristic
        // declaration attribute.
        if (_response.element_size == 7) {
            forward_response_and_terminate();
        } else {
            // 128 bit UUID.
            // read sequentially each characteristic declaration attribute
            // discovered.
            _idx = 0;
            read_characteristic_uuid();
        }
    }

    /**
     * Initiate read of the next characteristic declaration attribute.
     */
    void read_characteristic_uuid(void)
    {
        // note: use read multiple once different mtu size are supported ?
        uint16_t attribute_handle =
            bytes_to_u16(&_response.buffer[_idx * _response.element_size]);

        uint32_t err = sd_ble_gattc_read(connection_handle, attribute_handle, 0);
        if (err) {
            abort();
        }
    }

    /**
     * Handle read response of a characteristic declaration attribute.
     * It add the data in the response then initiate the read of the next
     * attribute or terminate the procedure if all characteristic declaration
     * attributes have been read.
     */
    void handle_uuid_read(const ble_gattc_evt_t &evt)
    {
        // should never happen
        if (!_response.buffer) {
            abort();
            return;
        }

        if (evt.gatt_status != BLE_GATT_STATUS_SUCCESS) {
            terminate(AttErrorResponse(
                          AttributeOpcode::READ_REQUEST,
                          convert_sd_att_error_code(evt.gatt_status)
                      ));
            return;
        }

        const ble_gattc_evt_read_rsp_t &rsp = evt.params.read_rsp;
        uint8_t *current_element = &_response.buffer[_idx * _response.element_size];
        uint16_t expected_handle = bytes_to_u16(current_element);

        if (rsp.handle != expected_handle || rsp.offset != 0 ||
                rsp.len != characteristic_declaration_length) {
            abort();
            return;
        }

        // note: elements are the pair characteristic declaration handle followed
        // by the attribute value.
        memcpy(current_element + 2, rsp.data, rsp.len);

        ++_idx;

        if (_idx == _response.count) {
            forward_response_and_terminate();
        } else {
            read_characteristic_uuid();
        }
    }

    /**
     * Terminate the procedure by forwarding the AttReadByTypeResponse built.
     */
    void forward_response_and_terminate()
    {
        terminate(SimpleAttReadByTypeResponse(
                      _response.element_size,
                      make_const_ArrayView(
                          _response.buffer,
                          _response.element_size * _response.count
                      )
                  ));
    }

    /**
     * Convert a ble_gattc_evt_char_disc_rsp_t into a raw response.
     *
     * If UUIDs present are 16 bits long then the output contain the whole
     * response. Otherwise only the handle declaration of each characteristic
     * discovered is present and properties, handle value and UUID are populated
     * by reading the attribute handle.
     */
    static read_by_type_response_t flatten_response(const ble_gattc_evt_char_disc_rsp_t &resp)
    {
        read_by_type_response_t result = { resp.count, 0 };

        bool short_uuid = (resp.chars[0].uuid.type == BLE_UUID_TYPE_BLE);

        // att handle + prop + value handle + uuid size
        result.element_size = 5 + (short_uuid ? 2 : 16) ;

        size_t buffer_size = resp.count * result.element_size;
        result.buffer = new (std::nothrow) uint8_t[buffer_size];
        if (!result.buffer) {
            return result;
        }

        uint8_t *it = result.buffer;
        for (size_t i = 0; i < resp.count; ++i) {
            u16_to_stream(it, resp.chars[i].handle_decl);
            if (short_uuid) {
                *it++ = get_properties(resp.chars[i]);
                u16_to_stream(it, resp.chars[i].handle_value);
                u16_to_stream(it, resp.chars[i].uuid.uuid);
            } else {
                // leave the characteristic value declaration empty; it will be
                // fullfiled by a read of the attribute.
                it += (1 + 2 + 16);
            }
        }

        return result;
    }

    /**
     * Compute characteristic properties from ble_gattc_char_t.
     */
    static uint8_t get_properties(const ble_gattc_char_t &char_desc)
    {
        return
            (char_desc.char_props.broadcast << 0) |
            (char_desc.char_props.read << 1) |
            (char_desc.char_props.write_wo_resp << 2) |
            (char_desc.char_props.write << 3) |
            (char_desc.char_props.notify << 4) |
            (char_desc.char_props.indicate << 5) |
            (char_desc.char_props.auth_signed_wr << 6) |
            (char_desc.char_ext_props << 7);
    }

    read_by_type_response_t _response;
    uint16_t _idx;
};

/**
 * Procedure that handle discovery of characteristic descriptors.
 */
struct nRF5XGattClient::DiscoverDescriptorsProcedure : RegularGattProcedure {
    DiscoverDescriptorsProcedure(connection_handle_t connection) :
        RegularGattProcedure(
            connection,
            AttributeOpcode::FIND_INFORMATION_REQUEST,
            BLE_GATTC_EVT_ATTR_INFO_DISC_RSP
        )
    {
    }

    ble_error_t start(attribute_handle_range_t discovery_range)
    {
        ble_gattc_handle_range_t range = to_nordic_handle_range(discovery_range);
        uint32_t err = sd_ble_gattc_attr_info_discover(
                           connection_handle,
                           &range
                       );

        return convert_sd_error(err);
    }

