ARMmbed/mbed-os/features/FEATURE_BLE/targets/TARGET_NORDIC/TARGET_NRF5/source/nRF5XPalGattClient.cpp
    virtual void do_handle(const ble_gattc_evt_t &evt)
    {
        /**
         * Adapt ble_gattc_evt_attr_info_disc_rsp_t into
         * pal::AttFindInformationResponse
         */
        struct CustomFindInformationResponse : AttFindInformationResponse {
            CustomFindInformationResponse(const ble_gattc_evt_attr_info_disc_rsp_t &resp) :
                AttFindInformationResponse(), response(resp) {}

            virtual size_t size() const
            {
                return response.count;
            }

#if (NRF_SD_BLE_API_VERSION < 3)
            virtual information_data_t operator[](size_t i) const
            {
                information_data_t result = {
                    response.attr_info[i].handle
                };

                if (response.format == BLE_GATTC_ATTR_INFO_FORMAT_16BIT) {
                    result.uuid = UUID(response.attr_info[i].info.uuid16.uuid);
                } else {
                    result.uuid = UUID(
                                      response.attr_info[i].info.uuid128.uuid128,
                                      UUID::LSB
                                  );
                }

                return result;
            }
#else
            virtual information_data_t operator[](size_t i) const
            {
                if (response.format == BLE_GATTC_ATTR_INFO_FORMAT_16BIT) {
                    information_data_t result = {
                        response.info.attr_info16[i].handle,
                        UUID(response.info.attr_info16[i].uuid.uuid)
                    };

                    return result;
                } else {
                    information_data_t result = {
                        response.info.attr_info128[i].handle,
                        UUID(
                            response.info.attr_info128[i].uuid.uuid128,
                            UUID::LSB
                        )
                    };

                    return result;
                }
            }


#endif


            const ble_gattc_evt_attr_info_disc_rsp_t &response;
        };

        terminate(CustomFindInformationResponse(evt.params.attr_info_disc_rsp));
    }
};


/**
 * Procedure that handle read of attribute handles.
 */
struct nRF5XGattClient::ReadAttributeProcedure : RegularGattProcedure {
    ReadAttributeProcedure(connection_handle_t connection) :
        RegularGattProcedure(
            connection, AttributeOpcode::READ_REQUEST, BLE_GATTC_EVT_READ_RSP
        ) { }

    ble_error_t start(attribute_handle_t attribute_handle)
    {
        uint32_t err = sd_ble_gattc_read(connection_handle, attribute_handle, 0);
        return convert_sd_error(err);
    }

    virtual void do_handle(const ble_gattc_evt_t &evt)
    {
        const ble_gattc_evt_read_rsp_t &rsp = evt.params.read_rsp;
        if (rsp.offset != 0) {
            abort();
            return;
        }

        terminate(AttReadResponse(make_const_ArrayView(rsp.data, rsp.len)));
    }
};

/**
 * Procedure that handle read of characteristic using characteristic UUID.
 */
struct nRF5XGattClient::ReadUsingCharacteristicUUIDProcedure : RegularGattProcedure {
    ReadUsingCharacteristicUUIDProcedure(connection_handle_t connection) :
        RegularGattProcedure(
            connection,
            AttributeOpcode::READ_BY_TYPE_REQUEST,
            BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP
        ) { }

    ble_error_t start(attribute_handle_range_t read_range, const UUID &uuid)
    {
        ble_uuid_t nordic_uuid = { 0 };
        ble_error_t ble_err = to_nordic_uuid(uuid, nordic_uuid);
        if (ble_err) {
            return ble_err;
        }

        ble_gattc_handle_range_t range = {
            read_range.begin,
            read_range.end
        };

        uint32_t err =  sd_ble_gattc_char_value_by_uuid_read(
                            connection_handle,
                            &nordic_uuid,
                            &range
                        );
        return convert_sd_error(err);
    }

#if (NRF_SD_BLE_API_VERSION >= 3)
    /**
     * Adapt ble_gattc_evt_char_val_by_uuid_read_rsp_t into AttReadByTypeResponse.
     */
    virtual void do_handle(const ble_gattc_evt_t &evt)
    {
        const ble_gattc_evt_char_val_by_uuid_read_rsp_t &rsp =
            evt.params.char_val_by_uuid_read_rsp;

        uint8_t element_size = sizeof(uint16_t) + rsp.value_len;

        terminate(SimpleAttReadByTypeResponse(
                      element_size,
                      make_const_ArrayView(
                          rsp.handle_value,
                          rsp.count * element_size
                      )
                  ));
    }

#else
    /**
     * Adapt ble_gattc_evt_char_val_by_uuid_read_rsp_t into AttReadByTypeResponse.
     */
    virtual void do_handle(const ble_gattc_evt_t &evt)
    {
        struct CustomReadByTypeResponse : AttReadByTypeResponse {
            CustomReadByTypeResponse(const ble_gattc_evt_char_val_by_uuid_read_rsp_t &rsp) :
                AttReadByTypeResponse(), response(rsp) { }

            virtual size_t size() const
            {
                return response.count;
            }

            virtual attribute_data_t operator[](size_t i) const
            {
                attribute_data_t result = {
                    response.handle_value[i].handle,
                    make_const_ArrayView(
                        response.handle_value[i].p_value,
                        response.value_len
                    )
                };
                return result;
            }

            const ble_gattc_evt_char_val_by_uuid_read_rsp_t &response;
        }

        terminate(CustomReadByTypeResponse(evt.params.char_val_by_uuid_read_rsp));
    }
#endif
};

/**
 * Procedure that handles read blob transactions.
 */
struct nRF5XGattClient::ReadAttributeBlobProcedure : RegularGattProcedure {
    ReadAttributeBlobProcedure(connection_handle_t connection) :
        RegularGattProcedure(
            connection, AttributeOpcode::READ_BLOB_REQUEST, BLE_GATTC_EVT_READ_RSP
        ) { }

