ARMmbed/mbed-os/features/FEATURE_BLE/targets/TARGET_NORDIC/TARGET_NRF5/source/nRF5XPalGattClient.cpp
    ble_error_t start(attribute_handle_t attribute_handle, uint16_t offset)
    {
        uint32_t err = sd_ble_gattc_read(
                           connection_handle, attribute_handle, offset
                       );
        return convert_sd_error(err);
    }

    virtual void do_handle(const ble_gattc_evt_t &evt)
    {
        terminate(AttReadBlobResponse(make_const_ArrayView(
                                          evt.params.read_rsp.data,
                                          evt.params.read_rsp.len
                                      )));
    }
};

/**
 * Procedure that handles Read Multiple Characteristic Values transactions.
 */
struct nRF5XGattClient::ReadMultipleCharacteristicsProcedure : RegularGattProcedure {
    ReadMultipleCharacteristicsProcedure(connection_handle_t connection) :
        RegularGattProcedure(
            connection,
            AttributeOpcode::READ_MULTIPLE_REQUEST,
            BLE_GATTC_EVT_CHAR_VALS_READ_RSP
        ) { }

    ble_error_t start(const ArrayView<const attribute_handle_t> &characteristic_handles)
    {
        uint32_t err = sd_ble_gattc_char_values_read(
                           connection_handle,
                           characteristic_handles.data(),
                           characteristic_handles.size()
                       );
        return convert_sd_error(err);
    }

    virtual void do_handle(const ble_gattc_evt_t &evt)
    {
        terminate(AttReadMultipleResponse(make_const_ArrayView(
                                              evt.params.char_vals_read_rsp.values,
                                              evt.params.char_vals_read_rsp.len
                                          )));
    }
};

/**
 * Procedure that handles Write transactions.
 */
struct nRF5XGattClient::WriteAttributeProcedure : RegularGattProcedure {
    WriteAttributeProcedure(connection_handle_t connection) :
        RegularGattProcedure(
            connection, AttributeOpcode::WRITE_REQUEST, BLE_GATTC_EVT_WRITE_RSP
        ) { }

    ble_error_t start(
        attribute_handle_t attribute_handle, const ArrayView<const uint8_t> &value
    )
    {
        ble_gattc_write_params_t write_params = {
            BLE_GATT_OP_WRITE_REQ,
            /* exec flags */ 0,
            attribute_handle,
            /* offset */ 0,
            static_cast<uint16_t>(value.size()),
            const_cast<uint8_t *>(value.data())
        };

        uint32_t err = sd_ble_gattc_write(connection_handle, &write_params);
        return convert_sd_error(err);
    }

    virtual void do_handle(const ble_gattc_evt_t &evt)
    {
        terminate(AttWriteResponse());
    }
};

/**
 * Procedure that handles Prepare Write transactions.
 */
struct nRF5XGattClient::QueuePrepareWriteProcedure : RegularGattProcedure {
    QueuePrepareWriteProcedure(connection_handle_t connection) :
        RegularGattProcedure(
            connection,
            AttributeOpcode::PREPARE_WRITE_REQUEST,
            BLE_GATTC_EVT_WRITE_RSP
        ) { }

    ble_error_t start(
        attribute_handle_t characteristic_value_handle,
        const ArrayView<const uint8_t> &value,
        uint16_t offset
    )
    {
        ble_gattc_write_params_t write_params = {
            BLE_GATT_OP_PREP_WRITE_REQ,
            /* exec flags */ 0,
            characteristic_value_handle,
            offset,
            static_cast<uint16_t>(value.size()),
            const_cast<uint8_t *>(value.data())
        };

        uint32_t err = sd_ble_gattc_write(connection_handle, &write_params);
        return convert_sd_error(err);
    }

    virtual void do_handle(const ble_gattc_evt_t &evt)
    {
        const ble_gattc_evt_write_rsp_t &response = evt.params.write_rsp;

        if (response.write_op != BLE_GATT_OP_PREP_WRITE_REQ) {
            abort();
            return;
        }

        terminate(AttPrepareWriteResponse(
                      response.handle,
                      response.offset,
                      make_const_ArrayView(response.data, response.len)
                  ));
    }
};

/**
 * Procedure that handles Execute Write transactions.
 */
struct nRF5XGattClient::ExecuteWriteQueueProcedure : RegularGattProcedure {
    ExecuteWriteQueueProcedure(connection_handle_t connection) :
        RegularGattProcedure(
            connection,
            AttributeOpcode::EXECUTE_WRITE_REQUEST,
            BLE_GATTC_EVT_WRITE_RSP
        ) { }

    ble_error_t start(bool execute)
    {
        ble_gattc_write_params_t write_params = {
            BLE_GATT_OP_EXEC_WRITE_REQ,
            static_cast<uint8_t>(
                execute ?
                BLE_GATT_EXEC_WRITE_FLAG_PREPARED_CANCEL :
                BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE
            ),
            /* attribute handle */ 0,
            /* value offset */ 0,
            /* buffer size*/ 0,
            /* buffer data */ NULL
        };

        uint32_t err = sd_ble_gattc_write(connection_handle, &write_params);
        return convert_sd_error(err);
    }

    virtual void do_handle(const ble_gattc_evt_t &evt)
    {
        const ble_gattc_evt_write_rsp_t &response = evt.params.write_rsp;
        if (response.write_op != BLE_GATT_OP_EXEC_WRITE_REQ) {
            abort();
            return;
        }

        terminate(AttExecuteWriteResponse());
    }
};

// NOTE: position after declaration of GattProcedure on purpose.
ble_error_t nRF5XGattClient::terminate()
{
    for (size_t i = 0; i < max_procedures_count; ++i) {
        if (_procedures[i]) {
            _procedures[i]->abort();
            _procedures[i] = NULL;
        }
    }

    return BLE_ERROR_NONE;
}

template<typename ProcType, typename A0>
ble_error_t nRF5XGattClient::launch_procedure(
    connection_handle_t connection, const A0 &a0
)
{
    ProcType *p = new (std::nothrow) ProcType(connection);
    if (!p) {
        return BLE_ERROR_NO_MEM;
    }

    if (!register_procedure(p)) {
        delete p;
        return BLE_ERROR_INVALID_STATE;
    }

    ble_error_t err = p->start(a0);
    if (err) {
        remove_procedure(p);
        delete p;
    }

