ARMmbed/mbed-os/features/FEATURE_BLE/targets/TARGET_NORDIC/TARGET_NRF5/source/nRF5XPalGattClient.cpp
    return err;
}

template<typename ProcType, typename A0, typename A1>
ble_error_t nRF5XGattClient::launch_procedure(
    connection_handle_t connection, const A0 &a0, const A1 &a1
)
{
    ProcType *p = new (std::nothrow) ProcType(connection);
    if (!p) {
        return BLE_ERROR_NO_MEM;
    }

    if (!register_procedure(p)) {
        delete p;
        return BLE_ERROR_INVALID_STATE;
    }

    ble_error_t err = p->start(a0, a1);
    if (err) {
        remove_procedure(p);
        delete p;
    }

    return err;
}

template<typename ProcType, typename A0, typename A1, typename A2>
ble_error_t nRF5XGattClient::launch_procedure(
    connection_handle_t connection,
    const A0 &a0, const A1 &a1, const A2 &a2
)
{
    ProcType *p = new (std::nothrow) ProcType(connection);
    if (!p) {
        return BLE_ERROR_NO_MEM;
    }

    if (!register_procedure(p)) {
        delete p;
        return BLE_ERROR_INVALID_STATE;
    }

    ble_error_t err = p->start(a0, a1, a2);
    if (err) {
        remove_procedure(p);
        delete p;
    }

    return err;
}

template<typename ProcType, typename A0, typename A1, typename A2, typename A3>
ble_error_t nRF5XGattClient::launch_procedure(
    connection_handle_t connection,
    const A0 &a0, const A1 &a1, const A2 &a2, const A3 &a3
)
{
    ProcType *p = new (std::nothrow) ProcType(connection);
    if (!p) {
        return BLE_ERROR_NO_MEM;
    }

    if (!register_procedure(p)) {
        delete p;
        return BLE_ERROR_INVALID_STATE;
    }

    ble_error_t err = p->start(a0, a1, a2, a3);
    if (err) {
        remove_procedure(p);
        delete p;
    }

    return err;
}

nRF5XGattClient::GattProcedure *nRF5XGattClient::get_procedure(
    connection_handle_t connection
) const
{
    for (size_t i = 0; i < max_procedures_count; ++i) {
        if (_procedures[i] && _procedures[i]->connection_handle == connection) {
            return _procedures[i];
        }
    }
    return NULL;
}

bool nRF5XGattClient::register_procedure(GattProcedure *p)
{
    if (get_procedure(p->connection_handle)) {
        return false;
    }

    for (size_t i = 0; i < max_procedures_count; ++i) {
        if (!_procedures[i]) {
            _procedures[i] = p;
            return true;
        }
    }

    return false;
}

bool nRF5XGattClient::remove_procedure(nRF5XGattClient::GattProcedure *p)
{
    for (size_t i = 0; i < max_procedures_count; ++i) {
        if (_procedures[i] == p) {
            _procedures[i] = NULL;
            return true;
        }
    }

    return false;
}

// singleton of the ARM Cordio client
nRF5XGattClient &nRF5XGattClient::get_client()
{
    static nRF5XGattClient _client;
    return _client;
}

void nRF5XGattClient::handle_events(const ble_evt_t *evt)
{
    switch (evt->header.evt_id) {
        case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP:
        case BLE_GATTC_EVT_REL_DISC_RSP:
        case BLE_GATTC_EVT_CHAR_DISC_RSP:
        case BLE_GATTC_EVT_DESC_DISC_RSP:
        case BLE_GATTC_EVT_ATTR_INFO_DISC_RSP:
        case BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP:
        case BLE_GATTC_EVT_READ_RSP:
        case BLE_GATTC_EVT_CHAR_VALS_READ_RSP:
        case BLE_GATTC_EVT_WRITE_RSP:
            get_client().handle_procedure_event(*evt);
            break;
        case BLE_GATTC_EVT_HVX:
            get_client().handle_hvx_event(*evt);
            break;
        case BLE_GATTC_EVT_TIMEOUT:
            get_client().handle_timeout_event(*evt);
            break;
    }
}

void nRF5XGattClient::handle_procedure_event(const ble_evt_t &evt)
{
    GattProcedure *p = get_procedure(evt.evt.gattc_evt.conn_handle);
    if (p) {
        p->handle(evt);
    }
}

void nRF5XGattClient::handle_hvx_event(const ble_evt_t &evt)
{
    connection_handle_t connection = evt.evt.gattc_evt.conn_handle;
    const ble_gattc_evt_hvx_t &hvx_evt = evt.evt.gattc_evt.params.hvx;

    switch (hvx_evt.type) {
        case BLE_GATT_HVX_NOTIFICATION:
            on_server_event(
                connection,
                AttHandleValueNotification(
                    hvx_evt.handle,
                    make_const_ArrayView(hvx_evt.data, hvx_evt.len)
                )
            );
            return;
        case BLE_GATT_HVX_INDICATION:
            // send confirmation first then process the event
            sd_ble_gattc_hv_confirm(connection, hvx_evt.handle);
            on_server_event(
                connection,
                AttHandleValueIndication(
                    hvx_evt.handle,
                    make_const_ArrayView(hvx_evt.data, hvx_evt.len)
                )
            );
            return;
        default:
            return;
    }
}

void nRF5XGattClient::handle_timeout_event(const ble_evt_t &evt)
{
    connection_handle_t connection = evt.evt.gattc_evt.conn_handle;
    GattProcedure *p = get_procedure(connection);
    if (p) {
        p->abort();
    }

    on_transaction_timeout(connection);
}

void nRF5XGattClient::handle_connection_termination(connection_handle_t connection)
{
    GattProcedure *p = get_client().get_procedure(connection);
    if (p) {
        p->abort();
    }
}

} // nordic
} // vendor
} // pal
} // ble




